alert(
  "Қош келдіңіз, саяхатшы! Сіз саяхатқа шыққалы жатырсыз. Сіздің таңдауыңыз - сіздің тағдырыңызды анықтайды."
);

let userName = prompt("Атыңызды жазыңыз:");

alert(userName + ", сіздің шытырман оқиғаңыз басталды!");

// 1-қадам
let first = prompt(
  "Сіз қиылыста тап болдыңыз. Сіз 'солға' немесе 'оңға' барасыз ба?"
);

if (first === "солға") {
  // true
  alert(
    "Сіз солға бұрылып, орманға кірдіңіз. Құпиялар мен қауіптер күтіп тұр."
  );
  // 2-қадам
  let second = prompt(
    "Сіз орманға жетіп, өзенді көрдіңіз. Сіз 'жүзесіз' бе әлде 'қайық' жасайсыз ба?"
  );

  if (second === "жүзесіз") {
    alert(
      "Сіз өзенді қауіпсіз өттіңіз, бірақ сәл шаршадыңыз. Жолды жалғастырасыз."
    );
    // 3-қадам
    let third = prompt(
      "Сіз жолда қазына сандығын табасыз. Сіз оны 'ашасыз' немесе 'тиіспейсіз' бе?"
    );

    if (third === "ашасыз") {
      alert("Құттықтаймыз! Сіз жасырын қазынаны таптыңыз!");
    } else {
      alert("Сіз қазынаға тимей өттіңіз. Қауіпсіз, бірақ қызықсыз жол!");
    }
  } else {
    alert("Қайықты жасап, өзеннен қауіпсіз өтіп, орманнан шығып кеттіңіз.");

    // 3-қадам
    let fourth = prompt(
      "Сіз жолда қазына сандығын табасыз. Сіз оны 'ашасыз' немесе 'тиіспейсіз' бе?"
    );

    if (fourth === "ашасыз") {
      alert("Құттықтаймыз! Сіз жасырын қазынаны таптыңыз!");
    } else {
      alert("Сіз қазынаға тимей өттіңіз. Қауіпсіз, бірақ қызықсыз жол!");
    }
  }
} else if (fourth === "оңға") {
  alert(
    "Сіз оңға бұрылып, тауларға қарай жүрдіңіз. Бұл жерде қорқынышты жағдайлар болуы мүмкін."
  );
  // 2-қадам
  let fifth = prompt("Сіз тауға жеттіңіз. Сіз 'шығады' немесе 'үңіледі' ме?");

  if (fifth === "шығады") {
    alert(
      "Таудан шыққанда, сізді үлкен бұғаз тосып тұр. Бірақ сіз оны аман-есен өттіңіз."
    );
    // 3-қадам
    let sixth = prompt(
      "Сіз жолда қазына сандығын табасыз. Сіз оны 'ашасыз' немесе 'тиіспейсіз' бе?"
    );

    if (sixth === "ашасыз") {
      alert("Құттықтаймыз! Сіз жасырын қазынаны таптыңыз!");
    } else {
      alert("Сіз қазынаға тимей өттіңіз. Бірақ сіздің жолыңыз әлі жалғасады.");
    }
  } else {
    alert(
      "Үңгірде сіз тұзаққа түсіп қалдыңыз! Өкінішке орай, сіз бұл шытырман оқиғаны аяқтай алмайсыз."
    );
  }
} else {
  alert("Таңдауыңыз дұрыс емес. Ойынды қайта бастаңыз.");
}
